<a href="https://colab.research.google.com/github/NaingKo9902/project1/blob/master/lab2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
pd.set_option("display.width", 70)

In [3]:
data = pd.read_csv('adult.csv')
data.head()

   age  workclass  fnlwgt  ... hours-per-week  native-country income
0   25    Private  226802  ...             40   United-States  <=50K
1   38    Private   89814  ...             50   United-States  <=50K
2   28  Local-gov  336951  ...             40   United-States   >50K
3   44    Private  160323  ...             40   United-States   >50K
4   18          ?  103497  ...             30   United-States  <=50K

[5 rows x 15 columns]

In [4]:
data["gender"].value_counts()

Male      32650
Female    16192
Name: gender, dtype: int64

In [5]:
data[data["gender"] == "Female"]["age"].mean()

36.92798913043478

In [6]:
print("{0:%}".format(data[data["native-country"] == "Germany"]
.shape[0] / data.shape[0]))

0.421768%

In [9]:
ages1 = data[data["income"] == "<=50K"]["age"]
ages2 = data[data["income"] == ">50K"]["age"]
print("<=50K: = {0} ± {1} years".format(ages1.mean(), ages1.std()))
print(" >50K: = {0} ± {1} years".format(ages2.mean(), ages2.std()))

<=50K: = 36.87218409366169 ± 14.104118026101577 years
 >50K: = 44.275177547702576 ± 10.558983370287825 years

In [10]:
high_educations = set(["Bachelors", "Prof-school", "Assoc-acdm",
                      "Assoc-voc", "Masters", "Doctorate"])
def high_educated(e):
    return e in high_educations
data[data["income"] == ">50K"]["education"].map(high_educated).all()

False

In [11]:
data.groupby(["race", "gender"])["age"].describe()

                             count       mean        std  ...   50%   75%   max
race               gender                                 ...
Amer-Indian-Eskimo Female    185.0  36.237838  12.840056  ...  35.0  46.0  80.0
                   Male      285.0  36.989474  11.703943  ...  35.0  44.0  82.0
Asian-Pac-Islander Female    517.0  35.657640  12.637799  ...  34.0  44.0  81.0
                   Male     1002.0  38.994012  12.824878  ...  37.0  46.0  90.0
Black              Female   2308.0  37.905979  12.736001  ...  36.0  46.0  90.0
                   Male     2377.0  37.922592  13.036981  ...  36.0  46.0  90.0
Other              Female    155.0  31.212903  11.233061  ...  29.0  37.0  74.0
                   Male      251.0  35.167331  11.808297  ...  32.0  42.5  77.0
White              Female  13027.0  36.882935  14.454178  ...  35.0  47.0  90.0
                   Male    28735.0  39.704507  13.475250  ...  38.0  49.0  90.0

[10 rows x 8 columns]

In [12]:
data[(data["race"] == "Amer-Indian-Eskimo")
& (data["gender"] == "Male")]["age"].max()

82

In [13]:
def is_married(m):
    return m.startswith("Married")
data["married"] = data["marital-status"].map(is_married)
(data[(data["gender"] == "Male") & (data["income"] == ">50K")]
    ["married"].value_counts())

True     8917
False    1001
Name: married, dtype: int64

In [14]:
m = data["hours-per-week"].max()
print("Maximum is {} hours/week.".format(m))
people = data[data["hours-per-week"] == m]
c = people.shape[0]
print("{} people work this time at week.".format(c))
s = people[people["income"] == ">50K"].shape[0]
print("{0:%} get >50K income.".format(s / c))

Maximum is 99 hours/week.
137 people work this time at week.
29.927007% get >50K income.

In [47]:
p = pd.crosstab(data["native-country"], data["income"],
values=data["hours-per-week"], aggfunc="mean")
p

income                          <=50K       >50K
native-country
?                           39.552590  45.318182
Cambodia                    41.157895  43.888889
Canada                      37.378151  46.126984
China                       36.686047  42.027778
Columbia                    39.123457  56.250000
Cuba                        39.201923  42.852941
Dominican-Republic          41.561224  42.800000
Ecuador                     37.948718  47.833333
El-Salvador                 35.819444  43.454545
England                     39.375000  46.297872
France                      40.090909  46.500000
Germany                     38.898649  45.706897
Greece                      41.870968  55.555556
Guatemala                   38.788235  36.666667
Haiti                       36.409091  40.666667
Holand-Netherlands          40.000000        NaN
Honduras                    34.055556  50.000000
Hong                        39.000000  43.750000
Hungary                     34.076923  46.333333
India                       38.044944  46.274194
Iran                        39.972973  47.954545
Ireland                     41.269231  45.181818
Italy                       38.690141  45.647059
Jamaica                     38.626374  42.400000
Japan                       39.733333  47.062500
Laos                        39.333333  40.000000
Mexico                      39.931416  45.638298
Nicaragua                   36.847826  38.333333
Outlying-US(Guam-USVI-etc)  41.409091  40.000000
Peru                        36.214286  40.000000
Philippines                 38.014286  43.588235
Poland                      37.228571  39.588235
Portugal                    41.254545  46.750000
Puerto-Rico                 38.908537  39.900000
Scotland                    40.833333  46.666667
South                       41.052632  51.400000
Taiwan                      35.307692  45.538462
Thailand                    43.040000  53.000000
Trinadad&Tobago             38.800000  40.000000
United-States               38.817189  45.471853
Vietnam                     37.848101  39.428571
Yugoslavia                  38.533333  43.375000

In [25]:
p.loc["Japan"]

income
<=50K    39.733333
>50K     47.062500
Name: Japan, dtype: float64

In [26]:
!pip install pandasql
from pandasql import sqldf
import pandas as pd

Collecting pandasql
  Downloading https://files.pythonhosted.org/packages/6b/c4/ee4096ffa2eeeca0c749b26f0371bd26aa5c8b611c43de99a4f86d3de0a7/pandasql-0.7.3.tar.gz
Requirement already satisfied: numpy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.18.3)
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.0.3)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.6/dist-packages (from pandasql) (1.3.16)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas->pandasql) (1.12.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-cp36-none-any.whl size=26819 sha256=dc420fa9d897016a735f34942ca2e35e1d9188a36171423d36b75b4f2362770d
  Stored in directory: /root/.cache/pip/wheels/53/6c/18/b87a2e5fa8a82e9c026311de56210b8d1c01846e18a9607fc9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [0]:
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [0]:
wind = (pd.read_csv('wind speed.csv', header=None,
names=["row", "UNIX", "date",
"time", "speed", "text"])
.drop("text", axis=1))
temp = (pd.read_csv('temperature.csv', header=None,
names=["row", "UNIX", "date",
"time", "temperature", "text"])
.drop("text", axis=1))

In [34]:
wind.head()

   row        UNIX        date      time  speed
0    1  1475315718  2016-09-30  23:55:18   7.87
1    2  1475315423  2016-09-30  23:50:23   7.87
2    3  1475315124  2016-09-30  23:45:24   9.00
3    4  1475314821  2016-09-30  23:40:21  13.50
4    5  1475314522  2016-09-30  23:35:22  15.75

In [35]:
wind.dtypes

row        int64
UNIX       int64
date      object
time      object
speed    float64
dtype: object

In [36]:
temp.head()

   row        UNIX        date      time  temperature
0    1  1475315718  2016-09-30  23:55:18           48
1    2  1475315423  2016-09-30  23:50:23           48
2    3  1475315124  2016-09-30  23:45:24           48
3    4  1475314821  2016-09-30  23:40:21           48
4    5  1475314522  2016-09-30  23:35:22           48

In [37]:
temp.dtypes

row             int64
UNIX            int64
date           object
time           object
temperature     int64
dtype: object

In [38]:
wind.merge(temp[["UNIX", "temperature"]], on="UNIX").head()

   row        UNIX        date      time  speed  temperature
0    1  1475315718  2016-09-30  23:55:18   7.87           48
1    2  1475315423  2016-09-30  23:50:23   7.87           48
2    3  1475315124  2016-09-30  23:45:24   9.00           48
3    4  1475314821  2016-09-30  23:40:21  13.50           48
4    5  1475314522  2016-09-30  23:35:22  15.75           48

In [39]:
%%timeit
wind.merge(temp[["UNIX", "temperature"]], on="UNIX")

100 loops, best of 3: 11.6 ms per loop

In [40]:
pysqldf("""SELECT w.row, w.UNIX, w.date, w.time,
w.speed, t.temperature
FROM wind AS w JOIN temp AS t
ON w.UNIX = t.UNIX
""").head()

   row        UNIX        date      time  speed  temperature
0    1  1475315718  2016-09-30  23:55:18   7.87           48
1    2  1475315423  2016-09-30  23:50:23   7.87           48
2    3  1475315124  2016-09-30  23:45:24   9.00           48
3    4  1475314821  2016-09-30  23:40:21  13.50           48
4    5  1475314522  2016-09-30  23:35:22  15.75           48

In [41]:
%%timeit
pysqldf("""SELECT w.row, w.UNIX, w.date, w.time,
                  w.speed, t.temperature
            FROM wind AS w JOIN temp AS t
            ON w.UNIX = t.UNIX
        """)

1 loop, best of 3: 500 ms per loop

In [42]:
wind.groupby("date")["speed"].mean().head()

date
2016-09-01    6.396560
2016-09-02    5.804086
2016-09-03    4.960248
2016-09-04    5.184571
2016-09-05    5.830676
Name: speed, dtype: float64

In [43]:
%%timeit
wind.groupby("date")["speed"].mean()

100 loops, best of 3: 2.65 ms per loop

In [44]:
pysqldf("""SELECT date, AVG(speed)
FROM wind
GROUP BY date
""").head()

         date  AVG(speed)
0  2016-09-01    6.396560
1  2016-09-02    5.804086
2  2016-09-03    4.960248
3  2016-09-04    5.184571
4  2016-09-05    5.830676

In [45]:
%%timeit
pysqldf("""SELECT date, AVG(speed)
FROM wind
GROUP BY date
""")

1 loop, best of 3: 201 ms per loop